Merge pull request #12 from wiktordepina/release/v0.8.2
chore: release v0.8.2
